{
  "menu": {
    "open": "Open Navegation Menu",
    "close": "Close Navigation Menu",
    "main-view": "Return to Main View",
    "about": "Go to About Me Section",
    "summary": "Summary",
    "skills": "My Skills",
    "experience": "Certificates and Experience",
    "socials": "Go to Contact and Credits Section",
    "projects": "Go to My Projects Section",
    "info_panel": "Help and Settings",
    "instructions_title": "How does this site work?",
    "instructions": "Here is a guide to navigate and interact with the site (click on the instructions to open a video tutorial):",
    "change_language": "Change Language",
    "english": "English",
    "spanish": "Spanish",
    "click_interact": "Click on highlighted objects to interact with them.",
    "click_and_drag": "Click and drag mouse to move the camera.",
    "scroll_zoom": "Scroll to zoom in and out.",
    "instructions_navigation": "You can also use the navigation menu on the left side to move between sections.",
    "instructions_download": "There is also an option to download my CV in PDF format on the left side.",
    "download": "Download CV in PDF format",
    "move_down_about": "Move Down to Summary Section",
    "move_up_skills": "Move Up to Skills Section",
    "move_down_experience": "Move Down to Experience Section",
    "move_up_about": "Move Up to About Section",
    "visit_link": "If you are interested in this project, you can check the source code on this Github link:"
  },
  "scene-renderer": {
    "loading-text": "Loading scene...",
    "progress": "files loaded."
  },
  "about": {
    "title": "About me",
    "description": "My name is David. I'm currently a 7th grade Software Engineering student with good academic and personal experience, seeking for entry level jobs involving backend development. The programming languages I have most experience with are C/C++, Javascript and PHP, as well as backend frameworks such as Node.js. I also have a good understanding on Linux systems, Git, database design and management, as well as a C1 proficiency level in the English language. My main strengths include a continuous curiosity and pursuit for learning about new technologies and concepts, ability to work in a team and communicate effectively with others, and a strong sense of abstraction and understanding of a project and its requirements. I am excited to connect with your organization in order to apply my skills to real world scenarios, continue learning, and ultimately bring value to your projects' vision to the best of my abilities."
  },
  "projects": {
    "title": "Projects",
    "cards": [
      {
        "title": "Collabtales - Imagine, write share, collaborate!",
        "description": "Collabtales is a web platform designed to create and develop stories in collaboration with others. Each user can start a story and generate a unique code to invite other participants to continue the narrative. The goal is to foster skills like creativity, teamwork, writing, and reading (especially in younger audiences). It was built using the Vue.js framework for the frontend, and PHP with a MySQL database for the backend. The platform includes features such as user authentication, story creation and management, and a voting system based on likes, plus localization support for both English and Spanish languages.",
        "image": "collabtales.png",
        "link": "https://collabtales.avaldez0.com",
        "github_link": "https://github.com/jd-becerra/collabtales"
      },
      {
        "title": "Chess Game for Nand2Tetris ",
        "description": "This project is a simulation of a chess game built for the Nand2Tetris platform, specifically designed to run within the VM Emulator. The main objective was to deepen my understanding of low-level programming and assembly language by implementing chessboard logic, move handling, and graphics rendering from scratch. This was made after completing course modules corresponding to building essential computer components like: a Virtual Machine, a simple CPU, the Operating System, plus a custom programming language, a compiler and a basic graphics library.",
        "image": "chess.png",
        "github_link": "https://github.com/jd-becerra/nand2tetris-Chess"
      },
      {
        "title": "Alicia - Demo for a Time Bending Game",
        "description": "This is a short, narrative-driven adventure game demo built in Godot that focuses on time manipulation mechanics. Developing this project gave me hands-on experience in key areas of game development, including programming functional game mechanics, creating a character control system based on unconventional physics, animation, and UI/UX design. The codebase showcases practical applications of software engineering principles such as event-driven programming, finite state machines, debugging, and optimization. NOTE: The demo was made with only Spanish language support.",
        "image": "alicia.png",
        "link": "https://alicia-juego.netlify.app/",
        "github_link": "https://github.com/jd-becerra/alicia"
      },
      {
        "title": "Interpolation Calculator",
        "description": "A small web tool developed for a Discrete Mathematics course, designed to visualize and compare four interpolation methods: Linear, Quadratic, and Lagrange of first and second order. Built with HTML, CSS, and JavaScript, it allows users to input data points and estimate unknown values using different interpolation techniques, displaying both the calculated results and the relative error percentage. The project integrates the GeoGebra API to graphically represent the data points, interpolation curves, and the estimated values, distinguishing between interpolation and extrapolation cases. NOTE: The tool and its documentation are only available in Spanish.",
        "image": "interpolation.png",
        "link": "https://metodos-interpolacion.netlify.app/",
        "github_link": "https://github.com/jd-becerra/interpolationCalculator"
      }
    ]
  },
  "hard-skills": {
    "title": "Technical skills",
    "expand": "Expand All Skills",
    "skills": [
      {
        "name": "C++",
        "description": "Mainly used through online programming courses like the CS50 by Harvard University and for self-learning subjects such as graphics programming with OpenGL, algorithms, data structures and manual memory management, using the language capabilities to seek better control and understanding of how code executes at lower levels."
      },
      {
        "name": "PHP",
        "description": "Used for an academic project that involved creating and managing a backend to be deployed on a Hostinger server. I designed and implemented custom APIs to connect a SQL database, focusing mainly on security (data validation, authentication, encryption, rate limiting, etc.). I also worked with extra libraries like Composer for dependency management, Firebase's JWT library for authentication, and PHP-Mailer for custom email notifications."
      },
      {
        "name": "JavaScript",
        "description": "A key part of my web development work, used in both frontend and backend to build dynamic web applications. My projects often combine JavaScript with frameworks like Vue and React, as well as backend technologies like Node.js."
      },
      {
        "name": "MySQL",
        "description": "This has been my main database management system for personal projects and academic work. My experience includes creating and connecting databases with backend technologies (PHP and Node.js), as well as designing the database architecture and implementing features such as stored procedures, functions, and triggers for better security and performance."
      },
      {
        "name": "Node.js",
        "description": "Mainly used during my Social Service program, where I designed and implemented custom APIs to connect SQL databases with frontend applications. I worked with libraries like JWT for authentication, JOI for data validation and Express to connect with additional APIs from other services in my school's ecosystem. My team was also in charge of writing the documentation for the APIs using Swagger, in order to facilitate integration with the frontend team."
      },
      {
        "name": "Linux",
        "description": "Linux has been my main operating environment for personal use and academic work. The main distributions I have worked with are: Arch, Ubuntu and Fedora. My regular use of Linux involves working extensively through the terminal, handling software installations, scripting tasks, and basic server management. I also have moderate experience with networking concepts through Cisco Academy courses and academic experience."
      },
      {
        "name": "Git",
        "description": "I regularly use Git for version control in both personal and team projects. My experience includes managing repositories, creating and merging branches, handling permissions, resolving merge conflicts, and organizing issues and pull requests to track project progress."
      },
      {
        "name": "English",
        "description": "I hold a TOEFL ITP certification at the C1 level, demonstrating a strong proficiency in reading, writing, listening, and speaking. This has allowed me to comfortably work with technical documentation, communicate effectively in academic, personal and professional contexts, and engage with a wide range of learning resources."
      }
    ]
  },
  "soft-skills": {
    "title": "Soft skills",
    "expand": "Expand All Skills",
    "skills": [
      {
        "name": "Ability to work in a team and communicate effectively",
        "description": "Throughout my journey as a software developer, I have always prioritized effective communication with my team members and peers. I always strive to be open and clear when giving feedback, actively listening to other people's perspectives and needs, and to always keep in mind the goal of the project and how it will benefit the client. As the teams I've worked with have been small, I've had the opportunity to take on different roles, and my flexibility has made my team members trust me into taking the lead when necessary. My C1 English score also enables me to communicate effectively with people from other countries."
      },
      {
        "name": "Adaptability and willingness to learn",
        "description": "I always keep in mind that the most important thing is the result, not the technology I use. I believe that having a strong understanding of the project and its requirements will enable me to choose the best tool for the job and to adapt to the unavoidable challenges that will arise. I don't mind being outside my comfort zone, and I actively look for ways to bridge gaps in my knowledge when confronting new problems."
      },
      {
        "name": "Problem Solving and Critical Thinking",
        "description": "I always need to understand how things work beneath the surface, trying not only to solve problems but to also understand 'why' a certain solution works, in case I need to modify it in the future or apply it to a different context. I approach problems systematically: breaking them down into smaller components, identifying potential causes, and testing potential solutions. As I've said previously, it's not about having the right answer immediately, but about being persistent in understanding the problem well enough to find the solution that works best."
      },
      {
        "name": "Self-motivation and discipline",
        "description": "Many of the technical skills I've developed came from self-initiated projects or online courses outside of formal schoolwork. Staying consistent and pushing through complex topics has taught me how to manage my time, structure learning goals, and follow through even when the material is difficult."
      }
    ]
  },
  "certificates": {
    "title": "Certificates",
    "expand": "Click on the panel to expand the image",
    "goto-link": "Go to certificate link",
    "content": [
      {
        "title": "TOEFL ITP",
        "description": "C1 level English proficiency certification, by the University of Colima.",
        "image": "toefl.jpg",
        "link": ""
      },
      {
        "title": "NDG Linux Essentials",
        "description": "Linux Essentials certification by Cisco Networking Academy. This helped me review and solidify my understanding of Linux systems, command line usage, and basic system administration.",
        "image": "ndg_linux.jpg",
        "link": ""
      },
      {
        "title": "CCNAv7: Introduction to Networks",
        "description": "Introduction to Networks certification by Cisco Networking Academy. This course taught me the fundamentals of networking, including protocols, IP addressing, and network design.",
        "image": "ccna.jpg",
        "link": ""
      },
      {
        "title": "Chinese for HSK 6",
        "description": "HSK 6 Chinese proficiency certification by Peking University on Coursera. The course focuses on reading and listening comprehension.",
        "image": "hsk6.jpeg",
        "link": "https://www.coursera.org/account/accomplishments/verify/7983U7F5RGUQ"
      }
    ]
  },
  "experience": {
    "title": "Experience",
    "education_title": "Education",
    "education_description": "I'm on my seventh semester of the Software Engineering program at the University of Colima (UdeC). Throughout my studies, I have built a foundation in software development, computer science principles, and web technologies. My coursework has covered areas such as algorithms, data structures, operating systems, databases, networking and web development. Additionally, I have gained hands-on experience with the software development lifecycle, team collaboration, and project management.",
    "exchange_title": "Exchange Program",
    "exchange_description": "I'm currently participating in an exchange program at the ITESO, Universidad Jesuita de Guadalajara, where I am taking courses in databases, mobile app development, and scalable systems design. This experience will allow me to broaden my horizons, gain new perspectives and meet new people in my field, all in a growing tech environment such as Guadalajara.",
    "social_service_title": "Social Service",
    "social_service_description": "I completed my Social Service program at the University of Colima, for the 'Educación a Distancia' (EDUC) platform, by designing and implementing the backend for the quizzes module, enabling teachers to create assessments as an additional review tool for students. My contributions included designing and updating the database as we got new requirements, creating and documenting APIs with Swagger, implementing JSON authentication and validation for security, and collaborating closely with both backend and frontend teams as well as professors to ensure the platform met evolving requirements and maintained stability. Overall, it was a very valuable experience with a great team and supervisors that even allowed us to appear on the 'About' page of the platform:",
    "social_service_link": "https://educ.ucol.mx/educ-about/"
  },
  "credits": {
    "title": "Credits",
    "description": "The 3D scene shown in this website was assembled on Blender using different models and textures, many of which were sourced from other creators that shared their work freely on the internet. Here I list the 3D models used for this project.",
    "note-title": "NOTE: ",
    "note": "If you are the owner of any content used here and have not been properly credited, please contact me so I can rectify the attribution.",
    "author_by": "made by: ",
    "link": "Link: ",
    "models": [
      {
        "name": "Wooden Ceiling Lamp",
        "author": "artistsquirrel",
        "link": "https://skfb.ly/ooM7Y"
      },
      {
        "name": "Note book",
        "author": "Skreater",
        "link": "https://skfb.ly/6QS8B"
      },
      {
        "name": "Picture Frame",
        "author": "Xander Morningstar",
        "link": "https://skfb.ly/6RDqw"
      },
      {
        "name": "Picture Frame",
        "author": "Wyme",
        "link": "https://skfb.ly/6QVN9"
      },
      {
        "name": "Window Frame",
        "author": "kshsh",
        "link": "https://skfb.ly/oExOX"
      },
      {
        "name": "Mars Poster",
        "author": "Whystler",
        "link": "https://skfb.ly/6WNyG"
      },
      {
        "name": "Desk Low-Poly",
        "author": "Pedro Belthori",
        "link": "https://skfb.ly/6RTZN"
      },
      {
        "name": "Computer Monitor",
        "author": "hungryshark25",
        "link": "https://skfb.ly/6W9Pu"
      },
      {
        "name": "Candle",
        "author": "Gnossiennes",
        "link": "https://skfb.ly/oKRNI"
      },
      {
        "name": "Flame Animation",
        "author": "ayvlasov",
        "link": "https://skfb.ly/RSUz"
      },
      {
        "name": "Chair V2",
        "author": "SketchyBot",
        "link": "https://skfb.ly/oXGZX"
      },
      {
        "name": "teacup",
        "author": "Mylom",
        "link": "https://skfb.ly/ptTMY"
      },
      {
        "name": "Waste Bin",
        "author": "Lasse Harm",
        "link": "https://skfb.ly/6XQI7"
      },
      {
        "name": "Optimized Potted Plants",
        "author": "Nicholas-3D",
        "link": "https://skfb.ly/oSYU7"
      },
      {
        "name": "Potted Plant, Mediterranean med leaf, low poly",
        "author": "dudecon",
        "link": "https://skfb.ly/opS6n"
      },
      {
        "name": "academic cap",
        "author": "ekaterinadzhabarova",
        "link": "https://skfb.ly/6XGOC"
      },
      {
        "name": "Scrolls - Low poly",
        "author": "Emma-Lie Kamping",
        "link": "https://skfb.ly/6Sw9I"
      },
      {
        "name": "Minecraft Tardis",
        "author": "LaserFont0103",
        "link": "https://skfb.ly/oQBEF"
      },
      {
        "name": "Estante - BookCase",
        "author": "MutArchitecture",
        "link": "https://skfb.ly/oCUTP"
      },
      {
        "name": "Wood Stand Book Reader",
        "author": "Francesco Coldesina",
        "link": "https://skfb.ly/6tQrP"
      },
      {
        "name": "FMB_Books_01",
        "author": "FreeMeshBase",
        "link": "https://skfb.ly/oSLAQ"
      },
      {
        "name": "Low Poly Flowers",
        "author": "Anskar",
        "link": "https://skfb.ly/6WtsA"
      },
      {
        "name": "Plant pots",
        "author": "Vanum-Chan",
        "link": "https://skfb.ly/6TSSo"
      },
      {
        "name": "Borboleta Azul - Butterfly",
        "author": "Lancaster Modelagem 3D",
        "link": "https://skfb.ly/6Yvoq"
      },
      {
        "name": "Star Trek Combadge",
        "author": "Flikd Design",
        "link": "https://skfb.ly/69KQT"
      },
      {
        "name": "Bank Exterior Plaque",
        "author": "abdillaamy",
        "link": "https://skfb.ly/69Vxr"
      },
      {
        "name": "Curtains from Poly by Google",
        "author": "IronEqual",
        "link": "https://skfb.ly/6XXNJ"
      },
      {
        "name": "Similar free VR / AR / Low poly 3D Models",
        "author": "DanielRiches",
        "link": "https://www.cgtrader.com/products/social-media-icons-ce7b4e53-d420-4464-a31c-aee9f3c5d6d2"
      },
      {
        "name": "Old Gmail Logo",
        "author": "PhantomXD",
        "link": "https://skfb.ly/6Wtqz"
      },
      {
        "name": "Fireplace Low-poly",
        "author": "MaX3Dd",
        "link": "https://skfb.ly/oForR"
      },
      {
        "name": "Animated fire",
        "author": "Yannick Deharo",
        "link": "https://skfb.ly/6AXQL"
      },
      {
        "name": "TeaScroll Clubhouse - Teapot Prop",
        "author": "Anaïs Faure",
        "link": "https://skfb.ly/6D8nL"
      },
      {
        "name": "Tea Table Set",
        "author": "HuyTrinh",
        "link": "https://skfb.ly/oNr9w"
      },
      {
        "name": "Sofa_Single",
        "author": "tjddn1985",
        "link": "https://skfb.ly/6Vwut"
      },
      {
        "name": "Pillow - Game Asset",
        "author": "deniskahvedzic",
        "link": "https://skfb.ly/6vrRX"
      },
      {
        "name": "Snow Trees Pack LOWPOLY",
        "author": "EFX",
        "link": "https://skfb.ly/prYWJ"
      },
      {
        "name": "low-poly Cars",
        "author": "MaX3Dd",
        "link": "https://skfb.ly/6SHCo"
      },
      {
        "name": "Low poly house",
        "author": "_its_sagar_bro",
        "link": "https://skfb.ly/o67qJ"
      },
      {
        "name": "Small Suburban House",
        "author": "Elephai",
        "link": "https://skfb.ly/oVPVO"
      },
      {
        "name": "Low Poly Solved Rubik's Cube",
        "author": "zhya",
        "link": "https://skfb.ly/oMxx9"
      },
      {
        "name": "Fence Low Poly",
        "author": "imlcbaylor",
        "link": "https://skfb.ly/o7zpJ"
      },
      {
        "name": "Flaticon - Scroll Icon",
        "author": "Smashicons",
        "link": "https://www.flaticon.com/free-icons/scroll-down"
      },
      {
        "name": "Flaticon - Drag and drop icons",
        "author": "bsd",
        "link": "https://www.flaticon.com/free-icons/drag-and-drop"
      },
      {
        "name": "Flaticon - interaction animated icons",
        "author": "Freepik",
        "link": "https://www.flaticon.com/free-animated-icons/interaction"
      },
      {
        "name": "Flaticon - United Kingdom free icon",
        "author": "Freepik",
        "link": "https://www.flaticon.com/free-icons/uk"
      },
      {
        "name": "Flaticon - Spain free icon",
        "author": "Freepik",
        "link": "https://www.flaticon.com/free-icons/spain"
      }
    ]
  }
}
