{
  "menu": {
    "open": "Navegation",
    "close": "Close",
    "main-view": "Return to Main View",
    "about": "About Me",
    "summary": "Summary",
    "skills": "My Skills",
    "experience": "Certificates, Education and Experience",
    "socials": "Contact and Credits",
    "projects": "My Projects",
    "info_panel": "Help",
    "click_interact": "Click on highlighted objects to interact with them",
    "click_and_drag": "Click and drag mouse to move the camera",
    "scroll_zoom": "Scroll to zoom in and out"
  },
  "scene-renderer": {
    "loading-text": "Loading scene...",
    "progress": "files loaded."
  },
  "about": {
    "title": "About me",
    "description": "Being a 6th grade Software Engineering student, I am always eager to learn and improve my skills in order to use them in a competitive and exciting environment. With this in mind, I'm currently seeking for entry level jobs to begin my career in software development.<br> The programming languages I have most experience with are Python, C/C++ and Javascript. I am also proficient working with Linux systems, which I regularly use for personal and academic purposes. I have a continuous pursuit for learning about new technologies and concepts, and I always strive to stay up-to-date with the latest tech news.<br> I am excited to connect with your organization in order to apply my skills in real scenarios, continue learning, and ultimately bring value to your projects' vision to the best of my abilities."
  },
  "projects": {
    "title": "Projects",
    "description": "Here you can find some of the projects I have worked on. You can find more on my GitHub profile.",
    "cards": [
      {
        "title": "Alicia - Demo for a Time Bending Game",
        "description": "This is a description of the first project.",
        "image": "img\\projects_scr\\p1.png",
        "link": "https://github.com/jd-becerra/alicia"
      },
      {
        "title": "Chess Game for Nand2Tetris ",
        "description": "This is a description of the second project.",
        "image": "img\\projects_scr\\p2.png",
        "link": "https://github.com/jd-becerra/nand2tetris-Chess"
      },
      {
        "title": "Interpolation Calculator",
        "description": "This is a description of the third project.",
        "image": "img\\projects_scr\\p3.png",
        "link": "https://github.com/jd-becerra/interpolationCalculator"
      }
    ]
  },
  "hard-skills": {
    "title": "Main technical skills:",
    "main-description": "Throughout my academic journey and personal projects, I have developed a set of technical skills that form the foundation of my work in software development, web technologies, backend systems, and computer science fundamentals. I strongly believe these skills reflect not only the tools and languages I have learned, but also the way I approach learning itself: with a focus on practical application, problem-solving, and a deep curiosity for understanding how systems work at every level.",
    "skills": [
      {
        "name": "C++",
        "description": " I have worked with C++ mainly for graphics programming projects using OpenGL, which helped me gain a deeper understanding of rendering pipelines and low-level graphics concepts. Additionally, I used C++ to strengthen my knowledge of algorithms, data structures, and manual memory management, both in academic coursework and through personal projects, where efficiency and control over system resources were important. I further developed these skills through courses like Harvard’s CS50 and the LearnOpenGL.com tutorial series, where I worked on practical implementations of computer science fundamentals and real-time rendering."
      },
      {
        "name": "PHP",
        "description": "I have used PHP primarily for backend development in web applications, particularly during my Social Service program at the University of Colima. I designed and implemented custom APIs to connect SQL databases with frontend applications, focusing on security, data validation, and performance. My experience includes working with frameworks like Laravel and CodeIgniter, which helped me understand how to structure web applications effectively and implement best practices in PHP development."
      },
      {
        "name": "JavaScript",
        "description": " JavaScript has been a key part of my web development work. I have used it both on the frontend and backend to build interactive and dynamic web applications. My projects often combine JavaScript with frameworks like Vue and React, as well as backend technologies like Node.js, giving me a practical understanding of how client-server architectures operate."
      },
      {
        "name": "MySQL",
        "description": " I have used SQL (through MySQL) to design and manage databases for personal projects and during my Social Service program at school. My experience includes not only creating and connecting databases with backend technologies like PHP and Node.js but also designing the database architecture and implementing advanced features such as stored procedures, functions, and triggers to improve performance and maintain data integrity."
      },
      {
        "name": "Node.js",
        "description": " I have used Node.js for backend development, particularly during my Social Service program, where I designed and implemented custom APIs to connect SQL databases with frontend applications. I worked with libraries like JWT for authentication, JOI for data validation, and Swagger for API documentation. These experiences helped me understand how to build backend systems that are secure, maintainable, and easy for frontend teams to integrate with."
      },
      {
        "name": "Linux",
        "description": " Linux has been my main operating environment for personal use and academic work. I have experience with distributions like Arch, Ubuntu, Fedora, and Lubuntu. My regular use of Linux involves working extensively through the terminal, handling software installations, scripting tasks, and basic server management. I also have moderate experience with networking concepts, which I strengthened through Cisco Academy courses focused on the fundamentals of networking and system administration."
      },
      {
        "name": "Git",
        "description": " I regularly use Git for version control in both personal and team projects. My experience includes managing repositories, creating and merging branches, handling permissions, resolving merge conflicts, and organizing issues and pull requests to track project progress. Using Git has helped me maintain clean development workflows, collaborate efficiently with others, and keep codebases organized and maintainable over time."
      },
      {
        "name": "English",
        "description": " I have a TOEFL ITP certification at the C1 level, which reflects a strong ability in reading, writing, listening, and speaking English. This has allowed me to comfortably work with technical documentation, communicate effectively in academic and professional contexts, and engage with a wide range of learning resources in the field of software development."
      }
    ]
  },
  "soft-skills": {
    "title": "Soft skills:",
    "main-description": "While I consider it important to have a strong technical background, having a good set of soft skills is even more crucial to succeed in any work setting. These are what I consider to be my stronger qualities, developed through academic work, personal development, and collaborative efforts:",
    "skills": [
      {
        "name": "Communication, collaboration, and effective listening",
        "description": "Throughout my journey as a software developer, I have always prioritized effective communication with my team members and peers, as I believe it to be the most important aspect for any collaborative effort. I always strive to be open and clear when giving feedback, actively listening to other people's perspectives and needs, and to always keep in mind the goal of the project and how it will benefit the client. My C1 English score also enables me to communicate effectively with people from other countries."
      },
      {
        "name": "Self-motivation and discipline",
        "description": "Many of the technical skills I've developed came from self-initiated projects or online courses outside of formal schoolwork. Staying consistent and pushing through complex topics has taught me how to manage my time, structure learning goals, and follow through even when the material is difficult."
      },
      {
        "name": "Adaptability and willingness to learn",
        "description": "I always keep in mind that the most important thing is the result, not the technology I use. I believe that having a strong understanding of the project and its requirements will enable me to choose the best tool for the job and to adapt to the unavoidable challenges that will arise. I don't mind being outside my comfort zone, and I actively look for ways to bridge gaps in my knowledge when confronting new problems."
      },
      {
        "name": "Curiosity, Analytical Thinking, and Problem Solving",
        "description": "It's not enough for me to use AI tools and frameworks to solve problems, I always need to understand how things work beneath the surface — aspects like how a neural network learns, how memory is managed in C++, how graphics are rendered or how machine code is parsed and executed. This curiosity pushes me to go beyond surface-level solutions and to explore the 'why' behind technical behaviors. I approach problems systematically: breaking them down into smaller components, identifying potential causes, and testing potential solutions. As I've said previously, it's not about having the right answer immediately, but about being persistent in understanding the problem well enough to find the solution that works best."
      }
    ]
  },
  "certificates": [
    {
      "title": "TOEFL ITP",
      "description": "C1 level English proficiency certification.",
      "image": "img\\certs\\toefl.jpg",
      "link": ""
    },
    {
      "title": "Chinese for HSK 6",
      "description": "HSK 6 level Chinese proficiency certification by Peking University on Coursera. The course focuses on reading and listening comprehension",
      "image": "img\\certs\\hsk6.jpeg",
      "link": "https://www.coursera.org/account/accomplishments/verify/7983U7F5RGUQ"
    },
    {
      "title": "NDG Linux Essentials",
      "description": "Linux Essentials certification by Cisco Networking Academy. This helped me solidify my understanding of Linux systems, command line usage, and basic system administration.",
      "image": "img\\certs\\ndg_linux.jpg",
      "link": ""
    },
    {
      "title": "CCNAv7: Introduction to Networks",
      "description": "Introduction to Networks certification by Cisco Networking Academy. This course taught me the fundamentals of networking, including protocols, IP addressing, and network design.",
      "image": "img\\certs\\ccna.jpg",
      "link": ""
    }
  ],
  "experience": {
    "title": "Experience",
    "education": "Education",
    "education-description": "I am currently in my seventh semester of the Software Engineering program at the University of Colima (UdeC). Throughout my studies, I have built a strong foundation in software development, computer science principles, and web technologies. My coursework has covered areas such as algorithms, data structures, operating systems, databases, and web development. Additionally, I have gained hands-on experience with the software development lifecycle, team collaboration, and project management.",
    "exchange": "Exchange Program",
    "exchange-description": "I''m currently participating in an exchange program at the ITESO, Universidad Jesuita de Guadalajara, where I am taking courses in databases, mobile app development, and scalable systems design. This experience will allow me to broaden my horizons, gain new perspectives and meet new people in my field, all in a growing tech environment such as Guadalajara.",
    "social-service": "Social Service",
    "social-service-description": "I completed my Social Service program at the University of Colima, for the 'Educacion a Distancia' (EDUC) platform, by designing and implementing the backend for the quizzes module, enabling teachers to create assessments and students to complete them for academic improvement. My contributions included designing and updating the database, creating and documenting APIs with Swagger, implementing JSON authentication and validation for security, and collaborating closely with both backend and frontend teams as well as professors to ensure the platform met evolving requirements and maintained stability."
  },
  "credits": {
    "title": "Credits",
    "description": "While I developed this portfolio website and created this 3D scene on Blender, I want to acknowledge that a lot of the models and textures were sourced from other creators that shared their work freely on the internet. Here are the 3D models I used in this scene:",
    "note": "If you see your work and it wasn't credited, please contact me so I can add it.",
    "models": [
      {
        "name": "Wooden Ceiling Lamp",
        "author": "artistsquirrel",
        "link": "https://skfb.ly/ooM7Y"
      },
      {
        "name": "Note book",
        "author": "Skreater",
        "link": "https://skfb.ly/6QS8B"
      },
      {
        "name": "Picture Frame",
        "author": "Xander Morningstar",
        "link": "https://skfb.ly/6RDqw"
      },
      {
        "name": "Picture Frame",
        "author": "Wyme",
        "link": "https://skfb.ly/6QVN9"
      },
      {
        "name": "Window Frame",
        "author": "kshsh",
        "link": "https://skfb.ly/oExOX"
      },
      {
        "name": "Mars Poster",
        "author": "Whystler",
        "link": "https://skfb.ly/6WNyG"
      },
      {
        "name": "Desk Low-Poly",
        "author": "Pedro Belthori",
        "link": "https://skfb.ly/6RTZN"
      },
      {
        "name": "Computer Monitor",
        "author": "hungryshark25",
        "link": "https://skfb.ly/6W9Pu"
      },
      {
        "name": "Candle",
        "author": "Gnossiennes",
        "link": "https://skfb.ly/oKRNI"
      },
      {
        "name": "Flame Animation",
        "author": "ayvlasov",
        "link": "https://skfb.ly/RSUz"
      },
      {
        "name": "Office Chair",
        "author": "artvolodskikh",
        "link": "https://skfb.ly/oDozK"
      },
      {
        "name": "teacup",
        "author": "Mylom",
        "link": "https://skfb.ly/ptTMY"
      },
      {
        "name": "Waste Bin",
        "author": "Lasse Harm",
        "link": "https://skfb.ly/6XQI7"
      },
      {
        "name": "Optimized Potted Plants",
        "author": "Nicholas-3D",
        "link": "https://skfb.ly/oSYU7"
      },
      {
        "name": "Tall Potted House Plant",
        "author": "DevonCarlson",
        "link": "https://skfb.ly/6WZnF"
      },
      {
        "name": "Pot plant - Dracena",
        "author": "Asia Matusik",
        "link": "https://skfb.ly/6xKTU"
      },
      {
        "name": "academic cap",
        "author": "ekaterinadzhabarova",
        "link": "https://skfb.ly/6XGOC"
      },
      {
        "name": "Scrolls - Low poly",
        "author": "Emma-Lie Kamping",
        "link": "https://skfb.ly/6Sw9I"
      },
      {
        "name": "Tardis WiP v2",
        "author": "Drakahn Finlay",
        "link": "https://skfb.ly/6qHrz"
      },
      {
        "name": "Estante - BookCase",
        "author": "MutArchitecture",
        "link": "https://skfb.ly/oCUTP"
      },
      {
        "name": "Wood Stand Book Reader",
        "author": "Francesco Coldesina",
        "link": "https://skfb.ly/6tQrP"
      },
      {
        "name": "FMB_Books_01",
        "author": "FreeMeshBase",
        "link": "https://skfb.ly/oSLAQ"
      },
      {
        "name": "Low Poly Flowers",
        "author": "Anskar",
        "link": "https://skfb.ly/6WtsA"
      },
      {
        "name": "Plant pots",
        "author": "Vanum-Chan",
        "link": "https://skfb.ly/6TSSo"
      },
      {
        "name": "Borboleta Azul - Butterfly",
        "author": "Lancaster Modelagem 3D",
        "link": "https://skfb.ly/6Yvoq"
      },
      {
        "name": "Star Trek Combadge",
        "author": "Flikd Design",
        "link": "https://skfb.ly/69KQT"
      },
      {
        "name": "Bank Exterior Plaque",
        "author": "abdillaamy",
        "link": "https://skfb.ly/69Vxr"
      },
      {
        "name": "Curtains from Poly by Google",
        "author": "IronEqual",
        "link": "https://skfb.ly/6XXNJ"
      },
      {
        "name": "Similar free VR / AR / Low poly 3D Models",
        "author": "DanielRiches",
        "link": "https://www.cgtrader.com/products/social-media-icons-ce7b4e53-d420-4464-a31c-aee9f3c5d6d2"
      },
      {
        "name": "Old Gmail Logo",
        "author": "PhantomXD",
        "link": "https://skfb.ly/6Wtqz"
      },
      {
        "name": "Fireplace Low-poly",
        "author": "MaX3Dd",
        "link": "https://skfb.ly/oForR"
      },
      {
        "name": "Animated fire",
        "author": "Yannick Deharo",
        "link": "https://skfb.ly/6AXQL"
      },
      {
        "name": "TeaScroll Clubhouse - Teapot Prop",
        "author": "Anaïs Faure",
        "link": "https://skfb.ly/6D8nL"
      },
      {
        "name": "Tea Table Set",
        "author": "HuyTrinh",
        "link": "https://skfb.ly/oNr9w"
      },
      {
        "name": "Sofa_Single",
        "author": "tjddn1985",
        "link": "https://skfb.ly/6Vwut"
      },
      {
        "name": "Pillow - Game Asset",
        "author": "deniskahvedzic",
        "link": "https://skfb.ly/6vrRX"
      },
      {
        "name": "Snow Trees Pack LOWPOLY",
        "author": "EFX",
        "link": "https://skfb.ly/prYWJ"
      },
      {
        "name": "low-poly Cars",
        "author": "MaX3Dd",
        "link": "https://skfb.ly/6SHCo"
      },
      {
        "name": "Neighborhood Street",
        "author": "TylerIngels",
        "link": "https://skfb.ly/oB7DA"
      },
      {
        "name": "Small Suburban House",
        "author": "Elephai",
        "link": "https://skfb.ly/oVPVO"
      },
      {
        "name": "Low Poly Solved Rubik's Cube",
        "author": "zhya",
        "link": "https://skfb.ly/oMxx9"
      },
      {
        "name": "Flaticon - Scroll Icon",
        "author": "Smashicons",
        "link": "https://www.flaticon.com/free-icons/scroll-down"
      },
      {
        "name": "Flaticon - Drag and drop icons",
        "author": "bsd",
        "link": "https://www.flaticon.com/free-icons/drag-and-drop"
      },
      {
        "name": "Flaticon - interaction animated icons",
        "author": "Freepik",
        "link": "https://www.flaticon.com/free-animated-icons/interaction"
      }
    ]
  }
}
