{
  "menu": {
    "open": "Abrir Menú de Navegación",
    "close": "Cerrar Menú de Navegación",
    "main-view": "Regresar a la vista principal",
    "about": "Ir a Sección 'Sobre mí'",
    "summary": "Resumen",
    "skills": "Mis habilidades",
    "experience": "Certificados y experiencia",
    "socials": "Ir a Sección 'Contacto y créditos'",
    "projects": "Ir a Sección 'Mis proyectos'",
    "info_panel": "Ayuda y Configuración",
    "instructions_title": "¿Cómo funciona este sitio?",
    "instructions": "Aquí hay una guía para navegar e interactuar con el sitio (haz clic en las instrucciones para abrir un tutorial en video):",
    "change_language": "Cambiar idioma",
    "english": "Inglés",
    "spanish": "Español",
    "click_interact": "Haz clic en los objetos resaltados para interactuar con ellos.",
    "click_and_drag": "Haz clic y arrastra el ratón para mover la cámara.",
    "scroll_zoom": "Desplázate para acercar y alejar la cámara.",
    "instructions_navigation": "También puedes usar el menú de navegación en el lado izquierdo para moverte entre secciones.",
    "instructions_download": "También hay una opción para descargar mi CV en formato PDF en el lado izquierdo.",
    "download": "Descargar CV en formato PDF",
    "move_down_about": "Bajar a la sección 'Resumen'",
    "move_up_skills": "Subir a la sección 'Habilidades'",
    "move_down_experience": "Bajar a la sección 'Experiencia'",
    "move_up_about": "Subir a la sección 'Sobre mí'",
    "visit_link": "Si estás interesado en este proyecto, puedes consultar el código fuente en este enlace de Github:"
  },
  "scene-renderer": {
    "loading-text": "Cargando escena...",
    "progress": "archivos cargados."
  },
  "about": {
    "title": "Sobre mí",
    "description": "Mi nombre es David. Actualmente soy estudiante de séptimo semestre de Ingeniería de Software con buena experiencia académica y personal, en busca de trabajos de nivel inicial relacionados con el desarrollo backend. Los lenguajes de programación con los que tengo más experiencia son C/C++, Javascript y PHP, así como frameworks backend como Node.js. También tengo un buen entendimiento de sistemas Linux, Git, diseño y gestión de bases de datos, así como un nivel de competencia C1 en el idioma inglés. Mis principales fortalezas incluyen una curiosidad continua y deseo de aprender sobre nuevas tecnologías y conceptos, capacidad para trabajar en equipo y comunicarme eficazmente con otros, y un fuerte sentido de abstracción y comprensión de un proyecto y sus requisitos. Estoy emocionado de conectar con su organización para aplicar mis habilidades en escenarios del mundo real, seguir aprendiendo y, en última instancia, aportar valor a la visión de sus proyectos al máximo de mis capacidades."
  },
  "projects": {
    "title": "Proyectos",
    "cards": [
      {
        "title": "Collabtales - ¡Imagina, escribe, comparte, colabora!",
        "description": "Collabtales es una plataforma web diseñada para crear y desarrollar historias en colaboración con otros. Cada usuario puede iniciar una historia y generar un código único para invitar a otros participantes a continuar la narrativa. El objetivo es fomentar habilidades como la creatividad, el trabajo en equipo, la escritura y la lectura (especialmente en audiencias jóvenes). Fue construida usando el framework Vue.js para el frontend, y PHP con una base de datos MySQL para el backend. La plataforma incluye funciones como autenticación de usuarios, creación y gestión de historias, y un sistema de votación basado en 'me gusta', además de soporte de localización para inglés y español.",
        "image": "collabtales.png",
        "link": "https://collabtales.avaldez0.com",
        "github_link": "https://github.com/jd-becerra/collabtales"
      },
      {
        "title": "Juego de ajedrez para Nand2Tetris",
        "description": "Este proyecto es una simulación de un juego de ajedrez construida para la plataforma Nand2Tetris, diseñada específicamente para ejecutarse en el VM Emulator. El objetivo principal fue profundizar mi comprensión de la programación de bajo nivel y el lenguaje ensamblador implementando la lógica del tablero de ajedrez, manejo de movimientos y renderizado gráfico desde cero. Se realizó después de completar módulos del curso relacionados con la construcción de componentes esenciales de una computadora como: una máquina virtual, una CPU simple, el sistema operativo, además de un lenguaje de programación personalizado, un compilador y una biblioteca gráfica básica.",
        "image": "chess.png",
        "github_link": "https://github.com/jd-becerra/nand2tetris-Chess"
      },
      {
        "title": "Alicia - Demo de un juego de manipulación del tiempo",
        "description": "Esta es una breve demo de un juego de aventuras narrativo construido en Godot que se centra en mecánicas de manipulación del tiempo. Desarrollar este proyecto me dio experiencia práctica en áreas clave del desarrollo de videojuegos, incluyendo la programación de mecánicas funcionales, la creación de un sistema de control de personajes basado en física no convencional, animación y diseño UI/UX. El código muestra aplicaciones prácticas de principios de ingeniería de software como programación orientada a eventos, máquinas de estados finitos, depuración y optimización. NOTA: La demo solo está disponible en español.",
        "image": "alicia.png",
        "link": "https://alicia-juego.netlify.app/",
        "github_link": "https://github.com/jd-becerra/alicia"
      },
      {
        "title": "Calculadora de interpolación",
        "description": "Una pequeña herramienta web desarrollada para un curso de Matemáticas Discretas, diseñada para visualizar y comparar cuatro métodos de interpolación: lineal, cuadrática y Lagrange de primer y segundo orden. Construida con HTML, CSS y JavaScript, permite a los usuarios ingresar puntos de datos y estimar valores desconocidos usando diferentes técnicas de interpolación, mostrando tanto los resultados calculados como el porcentaje de error relativo. El proyecto integra la API de GeoGebra para representar gráficamente los puntos de datos, las curvas de interpolación y los valores estimados, distinguiendo entre casos de interpolación y extrapolación. NOTA: La herramienta y su documentación solo están disponibles en español.",
        "image": "interpolation.png",
        "link": "https://metodos-interpolacion.netlify.app/",
        "github_link": "https://github.com/jd-becerra/interpolationCalculator"
      }
    ]
  },
  "hard-skills": {
    "title": "Habilidades técnicas",
    "expand": "Mostrar todas las habilidades",
    "skills": [
      {
        "name": "C++",
        "description": "Principalmente utilizado en cursos de programación en-línea como CS50 de la Universidad de Harvard y para temas de autoaprendizaje como programación gráfica con OpenGL, algoritmos, estructuras de datos y gestión manual de memoria, usando las capacidades del lenguaje para buscar un mejor control y comprensión de cómo se ejecuta el código a bajo nivel."
      },
      {
        "name": "PHP",
        "description": "Utilizado en un proyecto académico que implicó crear y gestionar un backend para ser desplegado en un servidor Hostinger. Diseñé e implementé APIs personalizadas para conectar una base de datos SQL, enfocándome principalmente en la seguridad (validación de datos, autenticación, cifrado, limitación de tasa, etc.). También trabajé con librerías adicionales como Composer para la gestión de dependencias, la librería JWT de Firebase para autenticación y PHP-Mailer para notificaciones por correo personalizadas."
      },
      {
        "name": "JavaScript",
        "description": "Una parte clave de mi trabajo en desarrollo web, utilizado tanto en frontend como en backend para construir aplicaciones web dinámicas. Mis proyectos suelen combinar JavaScript con frameworks como Vue y React, así como tecnologías backend como Node.js."
      },
      {
        "name": "MySQL",
        "description": "Ha sido mi principal sistema de gestión de bases de datos para proyectos personales y trabajo académico. Mi experiencia incluye crear y conectar bases de datos con tecnologías backend (PHP y Node.js), así como diseñar la arquitectura de la base de datos e implementar funciones como procedimientos almacenados, funciones y triggers para mayor seguridad y rendimiento."
      },
      {
        "name": "Node.js",
        "description": "Principalmente utilizado durante mi servicio social, donde diseñé e implementé APIs personalizadas para conectar bases de datos SQL con aplicaciones frontend. Trabajé con librerías como JWT para autenticación, JOI para validación de datos y Express para conectar con APIs adicionales de otros servicios en el ecosistema de mi escuela. Mi equipo también se encargó de escribir la documentación de las APIs usando Swagger, para facilitar la integración con el equipo frontend."
      },
      {
        "name": "Linux",
        "description": "Linux ha sido mi entorno operativo principal para uso personal y trabajo académico. Las principales distribuciones con las que he trabajado son: Arch, Ubuntu y Fedora. Mi uso regular de Linux implica trabajar extensamente desde la terminal, gestionar instalaciones de software, tareas de scripting y administración básica de servidores. También tengo experiencia moderada con conceptos de redes a través de cursos de Cisco Academy y experiencia académica."
      },
      {
        "name": "Git",
        "description": "Uso Git regularmente para control de versiones en proyectos personales y en equipo. Mi experiencia incluye gestionar repositorios, crear y fusionar ramas, gestionar permisos, resolver conflictos de fusión y organizar issues y pull requests para dar seguimiento al progreso del proyecto."
      },
      {
        "name": "Inglés",
        "description": "Cuento con certificación TOEFL ITP en nivel C1, demostrando una fuerte competencia en lectura, escritura, comprensión auditiva y expresión oral. Esto me ha permitido trabajar cómodamente con documentación técnica, comunicarme eficazmente en contextos académicos, personales y profesionales, y acceder a una amplia gama de recursos de aprendizaje."
      }
    ]
  },
  "soft-skills": {
    "title": "Habilidades blandas",
    "expand": "Mostrar todas las habilidades",
    "skills": [
      {
        "name": "Capacidad para trabajar en equipo y comunicarse eficazmente",
        "description": "A lo largo de mi trayectoria como desarrollador de software, siempre he priorizado la comunicación efectiva con mis compañeros de equipo y colegas. Siempre procuro ser abierto y claro al dar retroalimentación, escuchar activamente las perspectivas y necesidades de los demás, y tener siempre en mente el objetivo del proyecto y cómo beneficiará al cliente. Como los equipos con los que he trabajado han sido pequeños, he tenido la oportunidad de asumir diferentes roles, y mi flexibilidad ha hecho que mis compañeros confíen en mí para liderar cuando es necesario. Mi puntaje C1 en inglés también me permite comunicarme eficazmente con personas de otros países."
      },
      {
        "name": "Adaptabilidad y disposición para aprender",
        "description": "Siempre tengo presente que lo más importante es el resultado, no la tecnología que uso. Creo que tener una comprensión sólida del proyecto y sus requisitos me permitirá elegir la mejor herramienta para el trabajo y adaptarme a los desafíos inevitables que surgirán. No me molesta salir de mi zona de confort y busco activamente formas de cerrar brechas en mi conocimiento al enfrentar nuevos problemas."
      },
      {
        "name": "Resolución de problemas y pensamiento crítico",
        "description": "Siempre necesito entender cómo funcionan las cosas por debajo de la superficie, tratando no solo de resolver problemas sino también de entender 'por qué' una solución funciona, en caso de que necesite modificarla en el futuro o aplicarla en un contexto diferente. Abordo los problemas de manera sistemática: descomponiéndolos en componentes más pequeños, identificando posibles causas y probando soluciones potenciales. Como he dicho antes, no se trata de tener la respuesta correcta de inmediato, sino de ser persistente en comprender bien el problema para encontrar la solución que mejor funcione."
      },
      {
        "name": "Automotivación y disciplina",
        "description": "Muchas de las habilidades técnicas que he desarrollado provienen de proyectos auto-gestionados o cursos en línea fuera del trabajo escolar formal. Mantenerme constante y superar temas complejos me ha enseñado a gestionar mi tiempo, estructurar objetivos de aprendizaje y perseverar incluso cuando el material es difícil."
      }
    ]
  },
  "certificates": {
    "title": "Certificados",
    "expand": "Haz click en el panel para expandir la imagen",
    "goto-link": "Visitar enlace del certificado",
    "content": [
      {
        "title": "TOEFL ITP",
        "description": "Certificación de competencia en inglés nivel C1, por la Universidad de Colima.",
        "image": "toefl.jpg",
        "link": ""
      },
      {
        "title": "NDG Linux Essentials",
        "description": "Certificación Linux Essentials por Cisco Networking Academy. Esto me ayudó a repasar y solidificar mi comprensión de sistemas Linux, uso de la línea de comandos y administración básica de sistemas.",
        "image": "ndg_linux.jpg",
        "link": ""
      },
      {
        "title": "CCNAv7: Introducción a redes",
        "description": "Certificación Introducción a redes por Cisco Networking Academy. Este curso me enseñó los fundamentos de redes, incluyendo protocolos, direccionamiento IP y diseño de redes.",
        "image": "ccna.jpg",
        "link": ""
      },
      {
        "title": "Chino para HSK 6",
        "description": "Certificación de competencia en chino HSK 6 por la Universidad de Pekín en Coursera. El curso se centra en comprensión lectora y auditiva.",
        "image": "hsk6.jpeg",
        "link": "https://www.coursera.org/account/accomplishments/verify/7983U7F5RGUQ"
      }
    ]
  },
  "experience": {
    "title": "Experiencia",
    "education_title": "Educación",
    "education_description": "Estoy en mi séptimo semestre del programa de Ingeniería de Software en la Universidad de Colima (UdeC). A lo largo de mis estudios, he construido una base en desarrollo de software, principios de ciencias computacionales y tecnologías web. Mis cursos han abarcado áreas como algoritmos, estructuras de datos, sistemas operativos, bases de datos, redes y desarrollo web. Además, he adquirido experiencia práctica con el ciclo de vida del desarrollo de software, colaboración en equipo y gestión de proyectos.",
    "exchange_title": "Programa de intercambio",
    "exchange_description": "Actualmente participo en un programa de intercambio en el ITESO, Universidad Jesuita de Guadalajara, donde estoy tomando cursos de bases de datos, desarrollo de aplicaciones móviles y diseño de sistemas escalables. Esta experiencia me permitirá ampliar mis horizontes, obtener nuevas perspectivas y conocer nuevas personas en mi campo, todo en un entorno tecnológico en crecimiento como Guadalajara.",
    "social_service_title": "Servicio social",
    "social_service_description": "Completé mi servicio social en la Universidad de Colima, para la plataforma 'Educación a Distancia' (EDUC), diseñando e implementando el backend para el módulo de cuestionarios, permitiendo a los profesores crear evaluaciones como herramienta adicional de repaso para los estudiantes. Mis contribuciones incluyeron diseñar y actualizar la base de datos conforme recibíamos nuevos requisitos, crear y documentar APIs con Swagger, implementar autenticación y validación JSON para seguridad, y colaborar estrechamente tanto con los equipos backend y frontend como con profesores para asegurar que la plataforma cumpliera con los requisitos cambiantes y mantuviera la estabilidad. Esta fue una experiencia muy valiosa para mí, con un gran equipo y supervisores que incluso nos permitieron aparecer en la página 'Acerca de' de la plataforma:",
    "social_service_link": "https://educ.ucol.mx/educ-about/"
  },
  "credits": {
    "title": "Créditos",
    "description": "La escena 3D mostrada en este sitio web fue ensamblada en Blender utilizando varios modelos y texturas, muchos de los cuales fueron obtenidos de otros creadores que compartieron su trabajo libremente en internet. Aquí se listan los modelos 3D utilizados para este proyecto.",
    "note-title": "AVISO: ",
    "note": "Si eres el propietario de algún contenido utilizado y no has sido debidamente acreditado, por favor contáctame para que pueda rectificar la atribución.",
    "author_by": "realizado por: ",
    "link": "Enlace: ",
    "models": [
      {
        "name": "Wooden Ceiling Lamp",
        "author": "artistsquirrel",
        "link": "https://skfb.ly/ooM7Y"
      },
      {
        "name": "Note book",
        "author": "Skreater",
        "link": "https://skfb.ly/6QS8B"
      },
      {
        "name": "Picture Frame",
        "author": "Xander Morningstar",
        "link": "https://skfb.ly/6RDqw"
      },
      {
        "name": "Picture Frame",
        "author": "Wyme",
        "link": "https://skfb.ly/6QVN9"
      },
      {
        "name": "Window Frame",
        "author": "kshsh",
        "link": "https://skfb.ly/oExOX"
      },
      {
        "name": "Mars Poster",
        "author": "Whystler",
        "link": "https://skfb.ly/6WNyG"
      },
      {
        "name": "Desk Low-Poly",
        "author": "Pedro Belthori",
        "link": "https://skfb.ly/6RTZN"
      },
      {
        "name": "Computer Monitor",
        "author": "hungryshark25",
        "link": "https://skfb.ly/6W9Pu"
      },
      {
        "name": "Candle",
        "author": "Gnossiennes",
        "link": "https://skfb.ly/oKRNI"
      },
      {
        "name": "Flame Animation",
        "author": "ayvlasov",
        "link": "https://skfb.ly/RSUz"
      },
      {
        "name": "Chair V2",
        "author": "SketchyBot",
        "link": "https://skfb.ly/oXGZX"
      },
      {
        "name": "teacup",
        "author": "Mylom",
        "link": "https://skfb.ly/ptTMY"
      },
      {
        "name": "Waste Bin",
        "author": "Lasse Harm",
        "link": "https://skfb.ly/6XQI7"
      },
      {
        "name": "Optimized Potted Plants",
        "author": "Nicholas-3D",
        "link": "https://skfb.ly/oSYU7"
      },
      {
        "name": "Potted Plant, Mediterranean med leaf, low poly",
        "author": "dudecon",
        "link": "https://skfb.ly/opS6n"
      },
      {
        "name": "academic cap",
        "author": "ekaterinadzhabarova",
        "link": "https://skfb.ly/6XGOC"
      },
      {
        "name": "Scrolls - Low poly",
        "author": "Emma-Lie Kamping",
        "link": "https://skfb.ly/6Sw9I"
      },
      {
        "name": "Minecraft Tardis",
        "author": "LaserFont0103",
        "link": "https://skfb.ly/oQBEF"
      },
      {
        "name": "Estante - BookCase",
        "author": "MutArchitecture",
        "link": "https://skfb.ly/oCUTP"
      },
      {
        "name": "Wood Stand Book Reader",
        "author": "Francesco Coldesina",
        "link": "https://skfb.ly/6tQrP"
      },
      {
        "name": "FMB_Books_01",
        "author": "FreeMeshBase",
        "link": "https://skfb.ly/oSLAQ"
      },
      {
        "name": "Low Poly Flowers",
        "author": "Anskar",
        "link": "https://skfb.ly/6WtsA"
      },
      {
        "name": "Plant pots",
        "author": "Vanum-Chan",
        "link": "https://skfb.ly/6TSSo"
      },
      {
        "name": "Borboleta Azul - Butterfly",
        "author": "Lancaster Modelagem 3D",
        "link": "https://skfb.ly/6Yvoq"
      },
      {
        "name": "Star Trek Combadge",
        "author": "Flikd Design",
        "link": "https://skfb.ly/69KQT"
      },
      {
        "name": "Bank Exterior Plaque",
        "author": "abdillaamy",
        "link": "https://skfb.ly/69Vxr"
      },
      {
        "name": "Curtains from Poly by Google",
        "author": "IronEqual",
        "link": "https://skfb.ly/6XXNJ"
      },
      {
        "name": "Similar free VR / AR / Low poly 3D Models",
        "author": "DanielRiches",
        "link": "https://www.cgtrader.com/products/social-media-icons-ce7b4e53-d420-4464-a31c-aee9f3c5d6d2"
      },
      {
        "name": "Old Gmail Logo",
        "author": "PhantomXD",
        "link": "https://skfb.ly/6Wtqz"
      },
      {
        "name": "Fireplace Low-poly",
        "author": "MaX3Dd",
        "link": "https://skfb.ly/oForR"
      },
      {
        "name": "Animated fire",
        "author": "Yannick Deharo",
        "link": "https://skfb.ly/6AXQL"
      },
      {
        "name": "TeaScroll Clubhouse - Teapot Prop",
        "author": "Anaïs Faure",
        "link": "https://skfb.ly/6D8nL"
      },
      {
        "name": "Tea Table Set",
        "author": "HuyTrinh",
        "link": "https://skfb.ly/oNr9w"
      },
      {
        "name": "Sofa_Single",
        "author": "tjddn1985",
        "link": "https://skfb.ly/6Vwut"
      },
      {
        "name": "Pillow - Game Asset",
        "author": "deniskahvedzic",
        "link": "https://skfb.ly/6vrRX"
      },
      {
        "name": "Snow Trees Pack LOWPOLY",
        "author": "EFX",
        "link": "https://skfb.ly/prYWJ"
      },
      {
        "name": "low-poly Cars",
        "author": "MaX3Dd",
        "link": "https://skfb.ly/6SHCo"
      },
      {
        "name": "Low poly house",
        "author": "_its_sagar_bro",
        "link": "https://skfb.ly/o67qJ"
      },
      {
        "name": "Small Suburban House",
        "author": "Elephai",
        "link": "https://skfb.ly/oVPVO"
      },
      {
        "name": "Low Poly Solved Rubik's Cube",
        "author": "zhya",
        "link": "https://skfb.ly/oMxx9"
      },
      {
        "name": "Fence Low Poly",
        "author": "imlcbaylor",
        "link": "https://skfb.ly/o7zpJ"
      },
      {
        "name": "Flaticon - Scroll Icon",
        "author": "Smashicons",
        "link": "https://www.flaticon.com/free-icons/scroll-down"
      },
      {
        "name": "Flaticon - Drag and drop icons",
        "author": "bsd",
        "link": "https://www.flaticon.com/free-icons/drag-and-drop"
      },
      {
        "name": "Flaticon - interaction animated icons",
        "author": "Freepik",
        "link": "https://www.flaticon.com/free-animated-icons/interaction"
      },
      {
        "name": "Flaticon - United Kingdom free icon",
        "author": "Freepik",
        "link": "https://www.flaticon.com/free-icons/uk"
      },
      {
        "name": "Flaticon - Spain free icon",
        "author": "Freepik",
        "link": "https://www.flaticon.com/free-icons/spain"
      },
      {
        "name": "Flaticon - CV free icon",
        "author": "Freepik",
        "link": "https://www.flaticon.com/free-icons/cv"
      }
    ]
  }
}
